In [2]:
import seaborn as sb
import json

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Col1', 'Col2', 'Col3', 'Col4'])

In [5]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [6]:
#Accessing the Element
# 1. loc  2. iloc  loc--for Row Index
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int64

In [7]:
df.to_csv('Test1.csv')

In [8]:
type(df.loc['Row2'])

pandas.core.series.Series

In [9]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

In [10]:
df1=pd.read_csv('test.csv')

In [11]:
df1.head()

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0

In [12]:
df.iloc[0:2,0:2]

      Col1  Col2
Row1     0     1
Row2     4     5

In [13]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [14]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [15]:
df['Col1'].value_counts()

Col1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [16]:
test_df = pd.read_csv('test1.csv', sep=';')

In [17]:
test_df.head()

  ,Col1,Col2,Col3,Col4
0         Row1,0,1,2,3
1         Row2,4,5,6,7
2       Row3,8,9,10,11
3     Row4,12,13,14,15
4     Row5,16,17,18,19

In [18]:
df1['X0'].value_counts()

X0
ak    432
y     348
z     335
x     302
ay    299
t     293
o     246
f     213
w     198
j     171
n     167
aj    162
az    161
s     116
ap    108
al     88
h      64
d      61
e      48
v      40
ai     38
af     34
m      34
am     28
i      25
at     21
u      20
ba     19
a      18
b      13
ad     12
k      12
aq     11
aw     11
r      10
ax      8
as      6
bc      6
l       6
c       6
ao      5
au      5
g       3
ag      1
av      1
an      1
ae      1
p       1
bb      1
Name: count, dtype: int64

In [19]:
from io import StringIO, BytesIO

In [20]:
data = ('col1, col2, col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [21]:
type(data)

str

In [22]:
StringIO()

In [23]:
pd.read_csv(StringIO(data))

  col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [24]:
## Read from specific columns data types
df = pd.read_csv(StringIO(data), usecols=['col1', 'col3'], skipinitialspace=True)

In [25]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [26]:
df.to_csv('Test_Panda.csv')

In [27]:
data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12\n'
       '13,14,15,16')
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12
13,14,15,16

In [28]:
df=pd.read_csv(StringIO(data), dtype={'b': int, 'c': float, 'a':'Int64'})

In [29]:
df

    a   b     c   d
0   1   2   3.0   4
1   5   6   7.0   8
2   9  10  11.0  12
3  13  14  15.0  16

In [30]:
type(df['a'][1])

numpy.int64

In [31]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.6\n'
       '8,orange,dog,7')

In [32]:
pd.read_csv(StringIO(data), index_col=0)

            a    b    c
index
4       apple  bat  5.6
8      orange  dog  7.0

In [33]:
pd.read_csv(StringIO(data), usecols=['b', 'c'], index_col=False )

     b    c
0  bat  5.6
1  dog  7.0

In [34]:
#Escaping && Quoting --very useful in NLP
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [35]:
pd.read_csv(StringIO(data), escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5

In [36]:
data = [
  {"name": "Alice", "age": 22, "score": 85},
  {"name": "Bob", "age": 25, "score": 90},
  {"name": "Charlie", "age": 23, "score": 88}
]

In [37]:
type(data)

list

In [38]:
df = pd.DataFrame(data)
print(df)

      name  age  score
0    Alice   22     85
1      Bob   25     90
2  Charlie   23     88

In [39]:
pd.read_json("data.json")

      name  age  score
0    Alice   22     85
1      Bob   25     90
2  Charlie   23     88

In [40]:
Data = '{"employee_name": "Selmon", "email": "hello@gmail.com"}'
type(Data)
df = pd.read_json(StringIO(Data), orient="index")
print(df)

                             0
employee_name           Selmon
email          hello@gmail.com

In [41]:
df.to_json(orient="records")

'[{"0":"Selmon"},{"0":"hello@gmail.com"}]'

In [42]:
df

                             0
employee_name           Selmon
email          hello@gmail.com

In [43]:
df.to_json()

'{"0":{"employee_name":"Selmon","email":"hello@gmail.com"}}'

In [44]:
url = "https://www.fdic.gov/bank-failures/failed-bank-list"
dfs = pd.read_html(url)  ## return list of tables

In [45]:
dfs[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [46]:
url_mcc = "https://www.worldometers.info/world-population/population-by-country/"
dfs = pd.read_html(url_mcc, match='', header=0)

In [47]:
dfs[0]

,#,Country (or dependency),Population 2025,Yearly Change,Net Change,Density (P/KmÂ²),Land Area (KmÂ²),Migrants (net),Fert. Rate,Median Age,Urban Pop %,World Share
0,1,India,1463865525,0.89%,12929734,492,2973190,"âˆ’495,753",1.94,28.8,37.1%,17.78%
1,2,China,1416096094,âˆ’0.23%,"âˆ’3,225,184",151,9388211,"âˆ’268,126",1.02,40.1,67.5%,17.20%
2,3,United States,347275807,0.54%,1849236,38,9147420,1230663,1.62,38.5,82.8%,4.22%
3,4,Indonesia,285721236,0.79%,2233305,158,1811570,"âˆ’39,509",2.10,30.4,59.6%,3.47%
4,5,Pakistan,255219554,1.57%,3950390,331,770880,"âˆ’1,235,336",3.50,20.6,34.4%,3.10%
...,...,...,...,...,...,...,...,...,...,...,...,...
228,229,Montserrat,4359,âˆ’0.68%,âˆ’30,44,100,âˆ’9,1.45,41.6,11.5%,0.000053%
229,230,Falkland Islands,3469,âˆ’0.03%,âˆ’1,0,12170,âˆ’17,1.70,42.8,68%,0.000042%
230,231,Tokelau,2608,4.07%,102,261,10,53,2.57,27.3,NaN,0.000032%
231,232,Niue,1821,0.11%,2,7,260,3,2.46,35.7,44.5%,0.000022%
232,233,Holy See,501,1.01%,5,1253,0,13,1.00,57.4,NaN,0.0000061%

In [48]:
df_excel = pd.read_excel('FInal.xlsx')

In [50]:
df_excel.head()

,Click here to download the sheet,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,TIMELINE,4 Weeks (SET 1),8 Weeks (SET 1),12 Weeks,4 Weeks (SET 2),8 Weeks (SET 2),NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Start of Course,2026-01-19 00:00:00,2026-01-19 00:00:00,2026-01-19 00:00:00,2026-02-16 00:00:00,2026-02-16 00:00:00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,End of Course,2026-02-13 00:00:00,2026-03-13 00:00:00,2026-04-10 00:00:00,2026-03-13 00:00:00,2026-04-10 00:00:00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Exam Dates,"Mar 28/29, 2026\n2 Sessions on each date (9am-...",NaN,"Apr 17/18/19/24/25/26, 2026\n2 Sessions on eac...",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Possible additional exam dates\n(These dates c...,"Mar 27, 2026\n2 Sessions on each date (9am-12 ...",NaN,"April 20/27, 2026\n2 Sessions on each date (9a...",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [55]:
## Pickling
## Pickling = serializing a Python object into a byte stream
## Unpickling = deserializing it back into a Python object

In [56]:
df_excel.to_pickle('df_excel')

In [57]:
df = pd.read_pickle('df_excel')

In [58]:
df.head()

,Click here to download the sheet,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,TIMELINE,4 Weeks (SET 1),8 Weeks (SET 1),12 Weeks,4 Weeks (SET 2),8 Weeks (SET 2),NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Start of Course,2026-01-19 00:00:00,2026-01-19 00:00:00,2026-01-19 00:00:00,2026-02-16 00:00:00,2026-02-16 00:00:00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,End of Course,2026-02-13 00:00:00,2026-03-13 00:00:00,2026-04-10 00:00:00,2026-03-13 00:00:00,2026-04-10 00:00:00,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Exam Dates,"Mar 28/29, 2026\n2 Sessions on each date (9am-...",NaN,"Apr 17/18/19/24/25/26, 2026\n2 Sessions on eac...",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Possible additional exam dates\n(These dates c...,"Mar 27, 2026\n2 Sessions on each date (9am-12 ...",NaN,"April 20/27, 2026\n2 Sessions on each date (9a...",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN